Тест1/src/Reports/ДобавлениеПоДатам/ДобавлениеПоДатам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДобавлениеПоДатам</name>
</mdclass:Report>

Тест1/src/InformationRegisters/ДобавленоЗапчастейНаДату/ДобавленоЗапчастейНаДату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДобавленоЗапчастейНаДату</name>
  <resources>
    <name>колво</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/AccumulationRegisters/ДобавлениеЗапчастей/ДобавлениеЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДобавлениеЗапчастей</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест1/src/Reports/ДобавлениеПоДатам/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	РасчетГрафика();
	
КонецПроцедуры

&НаСервере
Функция РасчетГрафика()
	
	таблица1 = Новый ТаблицаЗначений;
	Текст = "ВЫБРАТЬ
	        |	ДобавленоЗапчастейНаДату.дата,
	        |	ДобавленоЗапчастейНаДату.колво
	        |ИЗ
	        |	РегистрСведений.ДобавленоЗапчастейНаДату КАК ДобавленоЗапчастейНаДату
	        |ГДЕ
	        |	ДобавленоЗапчастейНаДату.пользователь = &пользователь";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДобавлениеЗапчастей.пользователь
	               |ИЗ
	               |	РегистрНакопления.ДобавлениеЗапчастей КАК ДобавлениеЗапчастей";
	рез = Запрос.Выполнить().Выгрузить();
	м = Новый Массив;
	таблица1.Колонки.Добавить("Дата");
	Для Каждого стр из рез Цикл
		м.Добавить(стр.пользователь);
		таблица1.Колонки.Добавить(стр.пользователь.Наименование);
	КонецЦикла;
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("пользователь",пользователь);
	
	рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого стр Из рез Цикл

	КонецЦикла;
		
	возврат таблица1;
КонецФункции
